Documents/бит_ПодключениеУслугКЗданиям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_ПодключениеУслугКЗданиям</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бит_СведенияПоУслугамЛС</xr:Item>
				<xr:Item>InformationRegister.бит_ШаблоныУслуг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийПодключениеУслугКЗданиям</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Адреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Улица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/бит_ПодключениеУслугКЗданиям/Forms/ФормаДокументаУправляемая/Ext/Form/Module.bsl
#Область ПеременныеМодуля

&НаКлиенте 
Перем мКэшРеквизитовФормы;       // Хранит текущие значения реквизитов формы. Клиент.

#КонецОбласти

#Область РаботаСКэшемРеквизитовФормы

// Процедура заполняет кэш реквизитов формы данными объекта.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура ЗаполнитьТекущиеЗначенияРеквизитовФормы()
	
	Для Каждого КлючИЗначение Из мКэшРеквизитовФормы Цикл
		
		мКэшРеквизитовФормы[КлючИЗначение.Ключ] = Объект[КлючИЗначение.Ключ];
		
	КонецЦикла; 
	
КонецПроцедуры // ЗаполнитьТекущиеЗначенияРеквизитовФормы()

#КонецОбласти

#Область ПроцедурыИФункцииДляУправленияВнешнимВидомФорм

// Процедура устнавливает заголовок формы документа.
//
// Параметры:
//  Нет.
//
&НаКлиенте 
Процедура УстановитьЗаголовокФормыДокумента()
	
	СтруктураЗаголовка = Новый Структура;
	
	СтруктураЗаголовка.Вставить("ПредставлениеОбъекта", мКэшЗначений.ПредставлениеОбъекта);
	СтруктураЗаголовка.Вставить("СтрокаВидаОперации"  , мКэшЗначений.мВидОперации);
	СтруктураЗаголовка.Вставить("ЭтоНовый"			  , Параметры.Ключ.Пустая());
	СтруктураЗаголовка.Вставить("ДокументПроведен"	  , Объект.Проведен);
	
	бит_РаботаСДиалогамиКлиент.УстановитьЗаголовокФормыДокумента(ЭтаФорма
	,СтруктураЗаголовка);
	
КонецПроцедуры // УстановитьЗаголовокФормыДокумента()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьКэшЗначений(мКэшЗначений);
	
	// Вызов механизма разделения прав доступа.
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	бит_ПраваДоступа.ПередОткрытиемФормы(Отказ,СтандартнаяОбработка,ДокументОбъект,ЭтаФорма);
	
	бит_рлс_ОбщегоНазначения.ПроверитьБитыеСсылкиВОбъекте(Объект.Ссылка, Отказ);
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаСписокЗданий") Тогда
		
		НоваяСтрока = Объект.Адреса.Добавить();
		
		НоваяСтрока.Здание = Параметры.ЗаполнитьИзСправочникаСписокЗданий.Здание;
		НоваяСтрока.Улица  = Параметры.ЗаполнитьИзСправочникаСписокЗданий.Улица;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вывести в заголовке формы вид операции и статус документа (новый, не проведен, проведен).
	УстановитьЗаголовокФормыДокумента();
	
	// Зададим имена реквизитов, подлежащих кешированию.
	мКэшРеквизитовФормы = Новый Структура;
	
	// Запомним текущие значения реквизитов формы.
	ЗаполнитьТекущиеЗначенияРеквизитовФормы();
	
	// Установить активный реквизит.
	СтруктураРеквизитов = Новый Структура("Услуга");
	
	АктивизироватьРеквизитВФормеНаСервере(СтруктураРеквизитов);
	
	// Установить доступность формы с учетом даты запрета редактирования.	
	УстановитьДоступностьФормыДляРедактированияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// БИТ_ЖКХ 09.09.2016 11:55:28 Начало правки...
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:55:28 Конец правки.
	
	Оповестить("ИзменениеШаблонаУслуг",,ТипЗнч(Объект.Ссылка));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьЗаголовокФормыДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФорм

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", ПараметрыФормы, Элементы.Адреса, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПредыдущийВидОперации = мКэшЗначений.мВидОперации;
	
	ВидыОпераций = ПолучитьСписокВыбораВидаОперацииНаСервере();
	
	ВыбранныйЭлемент = Неопределено;
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ВидОперацииНачалоВыбораЗавершение", ЭтотОбъект, Новый Структура("ПредыдущийВидОперации", ПредыдущийВидОперации)), ВидыОпераций, Элементы.ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииНачалоВыбораЗавершение(ВыбранныйЭлемент1, ДополнительныеПараметры) Экспорт
    
    ПредыдущийВидОперации = ДополнительныеПараметры.ПредыдущийВидОперации;
    
    ВыбранныйЭлемент = ВыбранныйЭлемент1;
    
    Если ВыбранныйЭлемент <> Неопределено Тогда
        
        Если Не ВыбранныйЭлемент.Значение = Неопределено Тогда
            
            Если ПредыдущийВидОперации <> ВыбранныйЭлемент.Значение Тогда 
                
                Объект.ВидОперации = ВыбранныйЭлемент.Значение;
                
            КонецЕсли;
            
        КонецЕсли;
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.Адреса.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоля

&НаКлиенте
Процедура АдресаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Не НоваяСтрока Тогда
		
		мКэшЗначений.мЗдание = Элемент.ТекущиеДанные.Здание;	
		мКэшЗначений.мУлица  = Элемент.ТекущиеДанные.Улица;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение = Неопределено ИЛИ ВыбранноеЗначение.Количество() = 0 Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Для каждого Здание Из ВыбранноеЗначение Цикл
		
		Отбор = Новый Структура("Здание",Здание);
		
		НайденныеСтроки = Объект.Адреса.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			НоваяСтрока = Объект.Адреса.Добавить();
			
			НоваяСтрока.Здание = Здание;
			НоваяСтрока.Улица  = ПолучитьУлицуЗданияНаСервере(Здание);
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаУлицаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Адреса.ТекущиеДанные;
	
	Если ПолучитьУлицуЗданияНаСервере(ТекущаяСтрока.Здание) <> ТекущаяСтрока.Улица Тогда
		
		ТекущаяСтрока.Здание = ПредопределенноеЗначение("Справочник.бит_СписокЗданий.ПустаяСсылка");
		
	КонецЕсли;
	
	мКэшЗначений.мУлица = ТекущаяСтрока.Улица;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаЗданиеПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Адреса.ТекущиеДанные;
	
	СтароеЗначениеУлицы  = мКэшЗначений.мУлица;
	СтароеЗначениеЗдания = ТекущаяСтрока.Здание;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Здание) Тогда
		
		ТекущаяСтрока.Улица = ПолучитьУлицуЗданияНаСервере(ТекущаяСтрока.Здание);
		
	КонецЕсли;
	
	Если Не ПолучитьОрганизациюЗданияНаСервере(ТекущаяСтрока.Здание) = Объект.Организация 
		ИЛИ Не ТекущаяСтрока.Улица = СтароеЗначениеУлицы  Тогда
		
		ТекущаяСтрока.Здание = ?(ЗначениеЗаполнено(СтароеЗначениеЗдания),
		СтароеЗначениеЗдания,
		ПредопределенноеЗначение("Справочник.бит_СписокЗданий.ПустаяСсылка"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаЗданиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Необходимо указать организацию";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	
	ТекущаяСтрока = Элементы.Адреса.ТекущиеДанные;
	
	Отбор = Новый Структура;
	
	Отбор.Вставить("Организация", Объект.Организация);
	Отбор.Вставить("Улица", ТекущаяСтрока.Улица);
	
	ОткрытьФорму("Справочник.бит_СписокЗданий.Форма.ФормаВыбораУправляемая", Новый Структура("Отбор", Отбор), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресаЗданиеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Не ПолучитьОрганизациюЗданияНаСервере(ВыбранноеЗначение) = Объект.Организация Тогда
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура заполняет кэш значений, необходимый при работе на клиенте.
//
// Параметры:
//  КэшированныеЗначения - Структура.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений(КэшированныеЗначения)
	
	КэшированныеЗначения = Новый Структура;
	
	КэшированныеЗначения.Вставить("ПредставлениеОбъекта", Объект.Ссылка.Метаданные().ПредставлениеОбъекта);
	КэшированныеЗначения.Вставить("мВидОперации", Объект.ВидОперации);
	КэшированныеЗначения.Вставить("мУлица", Неопределено);
	КэшированныеЗначения.Вставить("мЗдание", Неопределено);
	
КонецПроцедуры // ЗаполнитьКэшЗначений()

&НаСервере
Функция ПолучитьСписокВыбораВидаОперацииНаСервере()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыОпераций.Ссылка
	|ИЗ
	|	Перечисление.бит_ВидыОперацийПодключениеУслугКЗданиям КАК ВидыОпераций";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	СписокВыбора = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		
		СписокВыбора.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат СписокВыбора;
	
КонецФункции

&НаСервере
Функция ПолучитьУлицуЗданияНаСервере(Здание)
	
	Возврат Здание.Улица;
	
КонецФункции

&НаСервере
Функция ПолучитьОрганизациюЗданияНаСервере(Здание)
	
	Возврат Здание.Организация;
	
КонецФункции

&НаСервере
Процедура АктивизироватьРеквизитВФормеНаСервере(СтруктураРеквизитов)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	
	бит_РаботаСДиалогамиСервер.АктивизироватьРеквизитВФорме(ДокументОбъект, ЭтаФорма, СтруктураРеквизитов);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьФормыДляРедактированияНаСервере()
	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, ПолучитьТипОбъекта(Объект.Ссылка));
	
	бит_РаботаСДиалогамиСервер.УстановитьДоступностьФормыДляРедактирования(ДокументОбъект, ЭтаФорма);
	
	ЗначениеВДанныеФормы(ДокументОбъект, Объект);
	
КонецПроцедуры

// БИТ_ЖКХ 13.10.2011 Функция получает тип объекта.
//
// Параметры:
//  ОбъектСсылка - ДокументСсылка.
//
// Возвращаемое значение:
//  ТипОбъекта - Тип.
// 
&НаСервереБезКонтекста 
Функция ПолучитьТипОбъекта(ОбъектСсылка)
	
	ИмяОбъекта = ОбъектСсылка.Метаданные().Имя;
	ТипОбъекта = Тип("ДокументОбъект." + ИмяОбъекта);
	
	Возврат ТипОбъекта;
	
КонецФункции // ПолучитьТипОбъекта()

#КонецОбласти
